#ifndef _LOG_MOUDLE_H
#define _LOG_MOUDLE_H
#include <stdarg.h>
/* -------------------------- 公共类型定义区  --------------------------- */

/* ========================== 公共类型定义区  =========================== */


//调用规定
#	define _LOG_CALLCONV __stdcall
//日志函数类型
typedef void (*LogFunc)(const char* prefix, const char * format, va_list m);

#ifdef _LOG_MOUDLE_EXPORTS
#	define _LOG_MOUDLE_API __declspec(dllexport)
#else 
#	define _LOG_MOUDLE_API __declspec(dllimport)
#endif 

/* -------------------------- 函数原型外部声明区 ----------------------- */
#ifdef __cplusplus 
extern "C" { 
#endif 
/*******************************************************************************
  函数名称: initWagentLog
  函数描述: 初始化WagentLog模块
  参    数: name:用于查询配置文件中的选项
  返 回 值: 0 成功；1失败；2 已经初始化
  历史记录:

*******************************************************************************/
_LOG_MOUDLE_API int	_LOG_CALLCONV LoadLogModule(const char* name, LogFunc f = NULL);
/*******************************************************************************
  函数名称: deinitWagentLog
  函数描述: 卸载WagentLog模块（程序退出的时候必须调用该函数来存储索引）
  参    数: 无
  返 回 值: 0 成功；1失败
  历史记录:

*******************************************************************************/
_LOG_MOUDLE_API int	_LOG_CALLCONV UnloadLogModule();

/*******************************************************************************
  函数名称: debugLog
  函数描述: 调试信息函数
  参    数: 
  历史记录:
*******************************************************************************/
_LOG_MOUDLE_API void _LOG_CALLCONV DebugLog(const char * f, ...);
/*******************************************************************************
  函数名称: infoLog
  函数描述: 普通信息函数
  参    数: 
  历史记录:
*******************************************************************************/
_LOG_MOUDLE_API void _LOG_CALLCONV InfoLog(const char * f, ...);
/*******************************************************************************
  函数名称: warnLog
  函数描述: 警告信息函数
  参    数: 
  历史记录:
*******************************************************************************/
_LOG_MOUDLE_API void _LOG_CALLCONV WarnLog(const char * f, ...);
/*******************************************************************************
  函数名称: errorLog
  函数描述: 错误信息函数
  参    数: 
  历史记录:
*******************************************************************************/
_LOG_MOUDLE_API void _LOG_CALLCONV ErrorLog(const char * f, ...);

/*******************************************************************************
函数名称: 测试进程间的全局变量拷贝
函数描述: 
参    数:
历史记录:
*******************************************************************************/
_LOG_MOUDLE_API void _LOG_CALLCONV GlobalTest();

#ifdef __cplusplus 
} 
#endif
/* ========================== 函数原型外部声明区 ========================== */

#endif